<?php

return [
    'title' => 'مدير برنامج :app',

    'welcome' => [
        'title' => 'أهلاً بك في مدير البرنامج',
        'text' => 'يمكنك استخدام بريدك المسجل لدينا وكلمة المرور للدخول الى حسابك والبدء في استخدام البرنامج'
    ],

    'login' => [
        'title' => 'تسجيل الدخول',
        'submit' => 'تسجيل الدخول',
        'remember' => 'تذكر هذا الحاسوب'
    ],

    'register' => [
        'title' => 'تسجيل حساب جديد',
        'submit' => 'تسجيل',
    ],

    'reset' => [
        'title' => 'نسيت كلمة المرور؟',
        'submit' => 'ارسال رابط تغير كلمة المرور لبريدك'
    ],

    'verify' => [
        'title' => 'يجب عليك تفعيل حسابك أولاً',
        'text' => 'قبل المتابعة، يرجى التحقق من بريدك الإلكتروني للحصول على رابط التحقق. إذا لم تستلم البريد الإلكتروني ، فانقر بالأسفل لطلب رسالة أخرى.',
        'submit' => 'طلب رسالة تفعيل آخرى',
        'resend' => 'تم إرسال رابط تحقق جديد إلى عنوان بريدك الإلكتروني.'
    ],

    'confirm' => [
        'submit' => 'الدخول للصفحة المحمية'
    ],

    'resources' => [
        'actions' => [
            'view' => 'مشاهدة',
            'edit' => 'تعديل',
            'delete' => [
                'tooltip' => 'حـذف نهائي',
                'title' => 'هل أنت متأكد من القيام بذلك؟',
                'text' => 'ستفقد معلومات السجل وعلاقاته أيضاً بشكل نهائي!',
                'confirm' => 'نعم، قم بالحذف',
                'cancel' => 'لا، إلغِ الأمر'
            ],
        ]
    ]
];
