<?php

return [
    'title' => 'مدير برنامج :app',
    'dashboard' => 'لوحة التحكم',

    'welcome' => [
        'title' => 'أهلاً بك في مدير البرنامج',
        'text' => 'يمكنك استخدام بريدك المسجل لدينا وكلمة المرور للدخول الى حسابك والبدء في استخدام البرنامج'
    ],

    'index' => [
        'title' => 'الرئيسية'
    ],

    'login' => [
        'title' => 'تسجيل الدخول',
        'submit' => 'تسجيل الدخول',
        'remember' => 'تذكر هذا الحاسوب'
    ],

    'register' => [
        'title' => 'تسجيل حساب جديد',
        'submit' => 'تسجيل',
    ],

    'reset' => [
        'title' => 'نسيت كلمة المرور؟',
        'update' => 'تحديث كلمة المرور الخاصة بك',
        'submit' => 'ارسال رابط تغير كلمة المرور لبريدك',
        'save' => 'حفظ ودخول'
    ],

    'verify' => [
        'title' => 'يجب عليك تفعيل حسابك أولاً',
        'text' => 'قبل المتابعة، يرجى التحقق من بريدك الإلكتروني للحصول على رابط التحقق. إذا لم تستلم البريد الإلكتروني ، فانقر بالأسفل لطلب رسالة أخرى.',
        'submit' => 'طلب رسالة تفعيل آخرى',
        'resend' => 'تم إرسال رابط تحقق جديد إلى عنوان بريدك الإلكتروني.'
    ],

    'confirm' => [
        'submit' => 'الدخول للصفحة المحمية'
    ],

    'layout' => [
        'search' => 'ابحث في الموقع',
        'notifications' => [
            'count' => 'لديك <strong class="text-primary">:count</strong> اشعار جديد'
        ],
    ],

    'widgets' => [
        'users-in-this-month' => [
            'title' => 'عدد المستخدمين',
            'info' => 'مستخدمين جدد هذا الشهر',
        ],
        'popular-roles' => [
            'title' => 'أكثر الرتب استخداماً',
            'info' => 'الرتبة التي تحتوي اعضاء اكثر',
        ],
        'permissions-count' => [
            'title' => 'الصلاحيات',
            'info' => 'عدد الصلاحيات المتاحة في البرنامج',
        ],
        'default-role' => [
            'title' => 'الرتبة الافتراضية',
            'info' => 'الرتبة الافتراضية عند تسجيل جديد',
        ],
    ]
];
