<?php

return [
    'resource' => 'المستخدمين',

    'fields' => [
        'id' => '#',
        'avatar' => 'الصورة الشخصية',
        'select_avatar' => 'اسقط أو اضغط لتحميل صورة شخصية جديدة',
        'name' => 'الاسم',
        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
        'role_id' => 'الرتبة/الصلاحيات',
        'password_confirmation' => 'تأكيد كلمة المرور',
        'current_password' => [
            'label' => 'كلمة المرور الحالية',
            'help' => 'ادخل كلمة مرور حسابك الحالي لتتمكن من تغير كلمة المرور'
        ],
        'created_at' => 'إنشء في',
        'updated_at' => 'أخر تعديل'
    ],

    'create' => [
        'title' => 'أضف مستخدم جديد',
        'cancel' => 'إلفاء',
        'save' => 'إنشاء المستخدم'
    ],

    'view' => [
        'action-button' => 'مشاهدة',
        'title' => 'مشاهدة صفحة :name'
    ],

    'edit' => [
        'action-button' => 'تعديل',
        'title' => 'تعديل',
        'cancel' => 'إلفاء',
        'save' => 'حفظ التغييرات'
    ],

    'delete' => [
        'action-button' => 'حـذف نهائي',
        'title' => 'هل أنت متأكد من القيام بذلك؟',
        'text' => 'ستفقد معلومات السجل وعلاقاته أيضاً بشكل نهائي!',
        'confirm' => 'نعم، قم بالحذف',
        'cancel' => 'لا، إلغِ الأمر'
    ],

    'messages' => [
        'created' => 'تم إنشاء المستخدم بنجاح',
        'updated' => 'تم تعديل المستخدم بنجاح',
        'deleted' => 'تم حذف المستخدم بنجاح'
    ]
];
